import streamlit as st
st.markdown("<h1 style='text-align: center; color: #9ACD32;'>사용자 정보 기반 메뉴 추천</h1>", unsafe_allow_html=True)

st.markdown("#### 안녕하세요, 팀25의 '오늘 뭐먹지'입니다.\
            <br>사용자 정보를 기반으로 메뉴를 추천해드립니다!", unsafe_allow_html=True)

reason=st.selectbox(
    '음식을 선택하는 이유를 선택해주세요',
    ('스트레스','지루함','우울함','배고픔','게으름','날씨','행복','여가생활','해당없음')
    )
    
fav=st.selectbox(
    '좋아하는 음식 종류를 선택해주세요',
    ('이탈리안/양식','아시안','중국음식','패스트푸드','한식','베이커리/스낵류','건강식','일식')
    )

fruit=st.selectbox(
    '과일 섭취량을 선택해주세요',
    ('전혀섭취하지않는다','섭취하지않는다','보통이다','섭취한다','많이섭취한다')
    )
pay=st.selectbox(
    '음식에 지불하는/지불할 비용을 선택해주세요',
    ('5천원미만','5천원~1만원','1만원~2만원','2만원~3만원','3만원~4만원','4만원이상')
    )   
veggies=st.selectbox(
    '야채 섭취량을 선택해주세요',
    ('전혀섭취하지않는다','섭취하지않는다','보통이다','섭취한다','많이섭취한다')
)

